# CanGroupHeaders Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..CanGroupHeaders Method
ViewSchedule Class See Also
---
Indicates if selected headers can be grouped for this schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanGroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
```

Visual Basic
---
```text
Public Function CanGroupHeaders ( _
	top As Integer, _
	left As Integer, _
	bottom As Integer, _
	right As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanGroupHeaders(
	int top,
	int left,
	int bottom,
	int right
)
```

# ### Parameters
top
    Type: System..::..Int32 The index of the top row of the selected headers.
left
    Type: System..::..Int32 The index of the left column of the selected headers.
bottom
    Type: System..::..Int32 The index of the bottom row of the selected headers.
right
    Type: System..::..Int32 The index of the right column of the selected headers.
# ### Return Value
True if the selected headers can be grouped, false otherwise.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace